In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\visit\anaconda3\lib\site-packages (2.9.9)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import psycopg2

In [5]:
engine = create_engine('postgresql+psycopg2://postgres:Olawale@localhost/mydatabase')

In [6]:
engine

Engine(postgresql+psycopg2://postgres:***@localhost/mydatabase)

In [8]:
pgpan = pd.read_sql(("SELECT * FROM africa "), engine)

In [9]:
pgpan

           name  population    gdp region
0       Nigeria   200000000  40000   West
1         Ghana     4500000   1000   West
2         Kenya    11000000   2000   East
3  South_Africa     4000000    102  South
4          Mali      100000    100   West

In [10]:
pgpan2 = pd.read_sql_query(("SELECT * FROM africa "), engine)

In [11]:
pgpan2

           name  population    gdp region
0       Nigeria   200000000  40000   West
1         Ghana     4500000   1000   West
2         Kenya    11000000   2000   East
3  South_Africa     4000000    102  South
4          Mali      100000    100   West

In [13]:
pgpan2 = pd.read_sql_query(("SELECT * FROM africa WHERE name = 'Nigeria' "), engine)

In [14]:
pgpan2

      name  population    gdp region
0  Nigeria   200000000  40000   West

In [16]:
Data={"name":["Togo","Zambia","Cameroon"], "population":[10000000,200000000,100000000],"gdp":[5000,4000,25000],"region":["West","South","Central"]}

In [17]:
Data

{'name': ['Togo', 'Zambia', 'Cameroon'],
 'population': [10000000, 200000000, 100000000],
 'gdp': [5000, 4000, 25000],
 'region': ['West', 'South', 'Central']}

In [21]:
Data=pd.DataFrame(Data)

In [22]:
Data

       name  population    gdp   region
0      Togo    10000000   5000     West
1    Zambia   200000000   4000    South
2  Cameroon   100000000  25000  Central

In [23]:
Data.to_sql("africa", engine, if_exists= "replace")

3